{"name":"SameName","children":[{"name": "ón","children":[{"name":"285196","children":[{"name": "MPC for tracking with optimal closed-loop performance."}]},{"name":"279921","children":[{"name": "Enlarging the domain of attraction of MPC controllers."}]},{"name":"285604","children":[{"name": "Open-loop Nash equilibrium in polynomial differential games via state-dependent Riccati equation."},{"name": "MPC for tracking piecewise constant references for constrained linear systems."},{"name": "Input to state stability of min-max MPC controllers for nonlinear systems with bounded uncertainties."},{"name": "Cooperative distributed MPC for tracking."}]}]},{"name": "á","children":[{"name":"285644","children":[{"name": "Angular position adaptive control of a squirrel-cage induction machine."}]},{"name":"274880","children":[{"name": "Adaptive cross-direction control of paper basis weight."}]},{"name":"289765","children":[{"name": "Lagrangian duality between constrained estimation and control."}]},{"name":"281044","children":[{"name": "Duality and symmetry in constrained estimation and control problems."},{"name": "Complexity reduction of explicit model predictive control via separation."}]},{"name":"283779","children":[{"name": "Probabilistic set invariance and ultimate boundedness."}]},{"name":"284588","children":[{"name": "Symmetry between constrained reference tracking and constrained state estimation."}]}]},{"name": "ä","children":[{"name":"282138","children":[{"name": "Worst-case control-relevant identification."}]},{"name":"285237","children":[{"name": "On model and filter sensitivity."},{"name": "Least-squares LTI approximation of nonlinear systems and quasistationarity analysis."}]},{"name":"281206","children":[{"name": "Laguerre series approximation of infinite dimensional systems."}]},{"name":"284449","children":[{"name": "Robustness in H"}]},{"name":"291119","children":[{"name": "On identification of stable systems and optimal approximation."},{"name": "Robust stabilization - BIBO stability, distance notions and robustness optimization."},{"name": "On linear models for nonlinear systems."}]},{"name":"283182","children":[{"name": "Approximation of stable systems by laguerre filters."}]},{"name":"287798","children":[{"name": "LTI modelling of NFIR systems: near-linearity and control, LS estimation and linearization."},{"name": "LTI approximation of nonlinear systems via signal distribution theory."},{"name": "H"},{"name": "A bicriteria stationary LQ control problem."},{"name": "Modelling of uncertain systems via linear programming."},{"name": "On robustness in control and LTI identification: Near-linearity and non-conic uncertainty."}]},{"name":"280605","children":[{"name": "Robust input-output stabilization on "},{"name": "Lethargy results in LTI System Modelling."}]},{"name":"289137","children":[{"name": "Squared and absolute errors in optimal approximation of nonlinear systems."}]},{"name":"277246","children":[{"name": "On robustness in system identification."},{"name": "Linear quadratic control revisited."}]}]},{"name": "è","children":[{"name":"275794","children":[{"name": "Stability analysis of planar systems with nilpotent (non-zero) linear part."}]},{"name":"288976","children":[{"name": "Robust tracking and performance for multivariable systems under physical parameter uncertainties"},{"name": "Linearization through state immersion of nonlinear systems admitting Lie symmetries."}]},{"name":"282600","children":[{"name": "Robust output regulation and tracking for linear periodic systems under structured uncertainties."}]},{"name":"280465","children":[{"name": "State estimation of (otherwise unobservable) linear mechanical systems through the use of non-smooth impacts: the case of two mating gears."}]},{"name":"284413","children":[{"name": "Model predictive control for constrained networked systems subject to data losses."}]},{"name":"286146","children":[{"name": "Exact and approximate feedback linearization without the linear controllability assumption."}]},{"name":"291187","children":[{"name": "Velocity observers for non-linear mechanical systems subject to non-smooth impacts."}]}]},{"name": "é","children":[{"name":"290900","children":[{"name": "Global stabilization of a class of partially known nonnegative systems."}]},{"name":"276653","children":[{"name": "Introduction to the special issue on stochastic modelling, control, and robust optimization at the crossroads of engineering, environmental economics, and finance."},{"name": "A polynomial approach to the MIMO LQ servo and disturbance rejection problems."}]},{"name":"280746","children":[{"name": "Convergence characteristics of a maximum likelihood load model identification scheme."}]},{"name":"285920","children":[{"name": "A mathematical framework for the control of piecewise-affine models of gene networks."}]},{"name":"287781","children":[{"name": "Near optimal interval observers bundle for uncertain bioreactors."}]},{"name":"292862","children":[{"name": "Approximation of the Feasible Parameter Set in worst-case identification of Hammerstein models."}]},{"name":"282720","children":[{"name": "Model quality evaluation in set membership identification."}]},{"name":"276039","children":[{"name": "New predictive scheme for the control of LTI systems with input delay and unknown disturbances."}]}]},{"name": "ñ","children":[{"name":"277764","children":[{"name": "Digital repetitive plug-in controller for odd-harmonic periodic references and disturbances."}]},{"name":"246760","children":[{"name": "A feedback-based L"}]}]},{"name": "ó","children":[{"name":"286570","children":[{"name": "On-line robust trajectory generation on approach and landing for reusable launch vehicles."}]},{"name":"279781","children":[{"name": "Digital repetitive plug-in controller for odd-harmonic periodic references and disturbances."}]},{"name":"277033","children":[{"name": "A feedback-based L"},{"name": "Digital repetitive plug-in controller for odd-harmonic periodic references and disturbances."}]}]},{"name": "Jo","children":[{"name":"291987","children":[{"name": "Optimal robust filtering for systems subject to uncertainties."}]},{"name":"207687","children":[{"name": "Supervision of integral-input-to-state stabilizing controllers."},{"name": "Root-mean-square gains of switched linear systems: A variational approach."},{"name": "Optimal robust filtering for systems subject to uncertainties."},{"name": "Robust state prediction for descriptor systems."},{"name": "Recursive linear estimation for general discrete-time descriptor systems."},{"name": "The full information and state feedback H"},{"name": "Adaptive predictive control with mean-square input constraint."},{"name": "Stabilization of nonholonomic integrators via logic-based switching."},{"name": "H"},{"name": "Robustness of multipredictor adaptive regulators: MUSMAR."},{"name": "Hysteresis-based switching algorithms for supervisory control of uncertain systems."},{"name": "Doubly coprime factorizations related to any stabilizing controllers in state space."},{"name": "Redundant data transmission in control/estimation over lossy networks."},{"name": "A semi-infinite horizon LQ self-tuning regulator for ARMAX plants based on RLS."},{"name": "Lyapunov conditions for input-to-state stability of impulsive systems."},{"name": "Switching between stabilizing controllers."}]}]},{"name": "öm","children":[{"name":"284058","children":[{"name": "Non-parametric identification of viscoelastic materials from wave propagation experiments."}]},{"name":"278380","children":[{"name": "Computationally efficient estimation of wave propagation functions from 1-D wave experiments on viscoelastic materials."}]},{"name":"204434","children":[{"name": "Fast switches in relay feedback systems."},{"name": "Non-parametric identification of viscoelastic materials from wave propagation experiments."},{"name": "Relay auto-tuning in the presence of static load disturbance."},{"name": "Automatic initialization of a robust self-tuning controller."},{"name": "Relations between Bias-Eliminating Least Squares, the Frisch scheme and Extended Compensated Least Squares methods for identifying errors-in-variables systems."},{"name": "Supervision of adaptive control algorithms."},{"name": "Identification of continuous-time AR processes from unevenly sampled data."},{"name": "Bayesian approaches for identification of the complex modulus of viscoelastic materials."},{"name": "Computationally efficient estimation of wave propagation functions from 1-D wave experiments on viscoelastic materials."},{"name": "Guidance and control of ocean vehicles : By Thor I. Fossen. Wiley, Chichester (1996). ISBN 0-471-94113-1."},{"name": "On the accuracy in errors-in-variables identification compared to prediction-error identification."},{"name": "Accuracy analysis of bias-eliminating least squares estimates for errors-in-variables systems."},{"name": "A contraction property for state feedback design of linear discrete-time systems."},{"name": "Unbalance estimation using linear and nonlinear regression."},{"name": "Industrial adaptive controllers based on frequency response techniques."},{"name": "Improved estimation performance using known linear constraints."},{"name": "Optimal state feedback control with a prescribed contraction property."},{"name": "System identification in a networked environment using second order statistical properties."},{"name": "The composition and validation of heterogeneous control laws."},{"name": "Control systems engineering education."}]}]},{"name": "ön","children":[{"name":"281031","children":[{"name": "Bayesian semiparametric Wiener system identification."}]},{"name":"278958","children":[{"name": "On parameter and state estimation for linear differential-algebraic equations."}]}]},{"name": "ZhiWu Li","children":[{"name":"278128","children":[{"name": "Authors' Reply to 'Comments on \"Liveness of an extended S"},{"name": "."},{"name": "A parameterized liveness and ratio-enforcing supervisor for a class of generalized Petri nets."}]},{"name":"276461","children":[{"name": "Liveness of an extended S"}]}]},{"name": "MengChu Zhou","children":[{"name":"284749","children":[{"name": "Authors' Reply to 'Comments on \"Liveness of an extended S"},{"name": "A parameterized liveness and ratio-enforcing supervisor for a class of generalized Petri nets."}]},{"name":"244352","children":[{"name": "Liveness of an extended S"},{"name": "Robust control reconfiguration of resource allocation systems with Petri nets and integer programming."}]}]},{"name": "C","children":[{"name":"279265","children":[{"name": "Diagonal stability of stochastic systems subject to nonlinear disturbances and diagonal H"}]},{"name":"284357","children":[{"name": "Optimal structured static state-feedback control design with limited model information for fully-actuated systems."}]}]},{"name": "ès","children":[{"name":"281808","children":[{"name": "A sufficient condition to test identifiability of nonlinear delayed-differential models with constant delays and multi-inputs."}]},{"name":"289924","children":[{"name": "Robust state-predictive control with separation property: A reduced-state design for control systems with non-equal time delays."}]}]},{"name": "ña","children":[{"name":"251807","children":[{"name": "Intermittent phenomena in adaptive systems: A case study."}]},{"name":"285463","children":[{"name": "Distributed model predictive control of nonlinear systems subject to asynchronous and delayed measurements."}]}]},{"name": "és","children":[{"name":"267091","children":[{"name": "Robust discrete time dynamic average consensus."},{"name": "Notes on averaging over acyclic digraphs and discrete coverage control."}]},{"name":"289930","children":[{"name": "On-line optimization of gas pipeline networks."}]},{"name":"288032","children":[{"name": "Simultaneous input and state estimation for nonlinear systems with applications to flow field estimation."}]}]},{"name": "Jos","children":[{"name":"285038","children":[{"name": "Symmetry between constrained reference tracking and constrained state estimation."}]},{"name":"203247","children":[{"name": "Global optimization of measurement strategies for linear stochastic systems."},{"name": "Optimal correction problem of a multidimensional stochastic system."},{"name": "Switched state feedback control for continuous-time uncertain systems."},{"name": "Large scale systems with multiple objectives: An interactive negotiation procedure."},{"name": "Lagrangian duality between constrained estimation and control."},{"name": "Affine and predictive control policies for a class of nonlinear systems."},{"name": "Symmetry between constrained reference tracking and constrained state estimation."},{"name": "Duality and symmetry in constrained estimation and control problems."},{"name": "Probabilistic set invariance and ultimate boundedness."},{"name": "Decentralized control through parameter space optimization."},{"name": "Optimal H"},{"name": "Multi-level hierarchical interface-based supervisory control."},{"name": "Some results on the stabilization of switched systems."},{"name": "Adaptive control of a hysteretic structural system."}]}]}]}